A1/RT2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    topwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       199300;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       199500;
    }
    leftWall
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          500;
        startFace       199700;
    }
    rightWall
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          500;
        startFace       200200;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          200000;
        startFace       200700;
    }
)

// ************************************************************************* //
